Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcode_flow/SUI_docs_tbl_barcode_flow.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_docs_tbl_barcode_flow</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ШтрихкодBase64</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШтрихкодКМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШтрихкодSSCC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>sid</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>sid_doc</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/InformationRegisters/SUI_docs_tbl_barcode_flow/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьТаблицуЭталон() Экспорт
	
	Таблица = Новый ТаблицаЗначений();
	
	Для Каждого Колонка Из SUI_ДокументыОбменаПовтИсп.КолонкиТаблицыПотокШтрихкодов() Цикл
		Таблица.Колонки.Добавить(Колонка.Имя, Колонка.Тип, Колонка.Заголовок);
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

Функция ЗагрузитьИзМобильногоУстройства(ИдентификаторДокументаОбмена, ЗагружаемаяТаблица) Экспорт
	
	Если ЗагружаемаяТаблица.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.SUI_docs_tbl_barcode_flow");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("sid_doc", ИдентификаторДокументаОбмена);
		Блокировка.Заблокировать();
		
		Для Каждого СтрокаТаблицы Из ЗагружаемаяТаблица Цикл
			
			Запись = СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, СтрокаТаблицы);
			
			Если ПустаяСтрока(Запись.barcode) Тогда
				ВызватьИсключение НСтр("ru = 'Не заполнен штрихкод.'");
			КонецЕсли;
			
			Запись.sid_doc = ИдентификаторДокументаОбмена;
			Запись.sid = Новый УникальныйИдентификатор();
			Запись.Период = ТекущаяДатаСеанса();
			
			Запись.Записать(Истина);
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ТекстОшибки = НСтр("ru = 'Не удалось загрузить поток штрихкодов документа обмена (%1)!'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ИдентификаторДокументаОбмена);
		ВызватьИсключение(ТекстОшибки, , , , ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
